/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (+%2$d أخرى)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "تعذر استخراج \"%1$@\" من الأرشيف \"%2$@\": %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "تعذر استخراج قسم الموارد التشعبي في الملف \"%1$@\" من الأرشيف \"%2$@\":\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "الترميز الافتراضي";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "اكتشاف تلقائي";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "استخراج";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "استخراج الأرشيف";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "جارٍ الاستخراج \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "جارٍ التحضير لاستخراج \"%@\"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "تحديد";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "حدد ملفات لاستخراج محتواها";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "لا يمكن استخراج محتويات \"%@\" بواسطة The Unarchiver.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "حدث خطأ أثناء استخراج محتويات الملف \"%1$@\": %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "حدث خطأ أثناء قراءة محتويات الملف \"%1$@\": %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "استخراج";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "يرجى إدخال كلمة مرور الأرشيف لفتح \"%@\".";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "إلى أين سيستخرج The Unarchiver الأرشيفات الخاصة بك؟";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "استخرج دائمًا إلى المجلد نفسه، أو دع التطبيق يسألك عن المكان المطلوب في كل مرة.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "السؤال كل مرة";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "استخراج إلى نفس المجلد";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "يحتاج The Unarchiver السماح له بحفظ الملفات المستخرجة في المجلد المحدد. انقر على \"استخراج\" للموافقة على هذا الإجراء.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "يحتاج The Unarchiver السماح له بالبحث عن أجزاء أخرى في الأرشيف المحدد في هذا الموقع. انقر على \"بحث\" للموافقة على هذا الإجراء.";

/* Panel OK button title when searching for more archive parts */
"Search" = "بحث";

/* Check for updates menu item */
"Check for Updates…" = "التحقق من وجود تحديثات…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "ملف الأرشيف غير كامل";
"Opening file failed" = "تعذر فتح الملف";
"Missing or wrong password" = "كلمة المرور المزودة غير صحيحة";
"Wrong checksum" = "ملف الأرشيف تالف";
"Could not create directory" = "تعذر إنشاء المجلد";

/* Uncommon or unused errors */
"Unknown error" = "خطأ غير معروف";
"Failed to write to file" = "فشلت الكتابة في الملف";
"Function called with illegal parameters" = "تم استدعاء الدالة بمعاملات غير مشروعة";
"Not enough memory available" = "لا تتوفر ذاكرة كافية";
"Data is corrupted" = "البيانات تالفة";
"File is not fully supported" = "الملف غير مدعوم بشكل كامل";
"Required resource missing" = "لم يُعثر على مورد مطلوب";
"Error on decrunching" = "حدث خطأ أثناء الاستخراج";
"Unknown file type" = "نوع الملف غير معروف";
"File, disk has been skipped" = "تم تخطي ملف، قرص";
"User cancelled extraction" = "ألغى المستخدم الاستخراج";
"File already exists" = "الملف موجود بالفعل";
"Verify failed (disk hook)" = "فشل التحقق ‪(‬disk hook‪)‬";
"Wrong drive geometry" = "خطأ في هندسة القرص";
"Unknown data format" = "تنسيق بيانات غير معروف";
"Source contains no files" = "المصدر لا يحتوي على ملفات";
"Unknown filesystem" = "نظام ملفات غير معروف";
"Name of file exists as directory" = "اسم الملف موجود مسبقًا كاسم لدليل";
"Buffer was too short" = "المخزن المؤقت قصير للغاية";
"Text encoding was defective" = "يوجد خطأ في ترميز النص";
"Could not create symlink" = "تعذر إنشاء الرابط الرمزي";

"AlertTitle_SetFileTypeAssociationAppStore" = "فكّر في تعيين The Unarchiver التطبيق الافتراضي لأنواع ملفات محددة.";
"AlertDescription_SetFileTypeAssociationAppStore" = "انقر على \"الحصول على معلومات\" في القائمة السياقية للملف، واختر The Unarchiver من قائمة \"فتح بواسطة:\". انقر على \"تغيير الكل…\" لتطبيق هذا على جميع الأرشيفات المشابهة.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "تعيين تطبيق آخر كتطبيق افتراضي لأنواع ملفات محددة، إذا كنت ترغب في ذلك.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "انقر على \"الحصول على معلومات\" في القائمة السياقية للملف، واختر التطبيق المطلوب من قائمة \"فتح بواسطة:\". انقر على \"تغيير الكل…\" لتطبيق هذا على جميع الأرشيفات المشابهة.";

/* About window */
"Standalone" = "مستقل";

/* Extracted view */
"extracted" = "تم الاستخراج";
